import requests, random, os, pickle,telebot
from colorama import Back, init
import threading

o = "\u001b[38;5;208m"# برتقالي 
e = "\u001b[38;5;242m" #رمادي داكن
E = "\u001b[38;5;8m" #رمادي فاتح
m = "\u001b[38;5;15m" #ابيض
F = "\u001b[38;5;40m" #اخضر
b = "\u001b[38;5;14m" #سمائي
y = "\u001b[38;5;33m" #ازرق
j= "\u001b[38;5;200m" #وردي
x = "\u001b[38;5;226m" #اصفر
Z = "\u001b[38;5;9m" #احمر
p = '\x1b[1m'#عريض
g = '\x1b[0m'#استعادة افتراضي


response = requests.get("http://headers.scrapeops.io/v1/user-agents?api_key=b64f17a8-367b-4cd5-8efb-46a1eeb583eb")
if response.status_code == 200:
        user_agent = response.json()['result'][0]
else:
        print(" ERORR API USER AGENT ❌ ")


logo = """

⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⢸⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣷⣽⣻⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢜⣽⣿⣿⣿⣿⣿⢿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⣷⣿⣿⣿⣿⣿⣿⡏⠛⣅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣟⣿⣿⣿⣿⣿⣿⣿⣿⣸⣷⡘⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣴⣶⣾⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⢧⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⠴⢾⣿⣿⣵⣶⣿⣿⡿⢿⣿⣿⣿⣿⣿⣿⣿⡿⣾⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⢴⣫⣷⣾⣿⣿⣿⣿⣏⡴⣫⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⢷⣿⣿⣿⠃⠀⠀⠀⢀⢠⡀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣰⢞⣵⣿⣿⣿⣿⣿⣿⣿⣿⣵⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡸⣿⡟⠉⠀⢀⡴⣆⡿⣺⣷⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣳⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣽⣗⣛⣛⣭⣥⣾⣿⣿⡇⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡴⣟⣭⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⢿⡟⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣽⣿⢿⣻⣿⠿⠋⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⢴⣿⣵⣿⣿⣿⣟⠛⠻⠿⣿⣿⣿⡟⣿⣿⣿⣻⢈⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣻⣿⡿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⢴⣺⣽⣾⣿⣿⣿⣿⡿⢿⣒⣀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣾⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣛⣛⣛⣛⣛⣯⣵⣾⡿⣟⣵⣿⣿⣿⣿⣿⣽⣿⣿⣿⣿⣽⣇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠫⣽⣟⣛⣛⣛⣿⣭⣷⣾⣿⣿⣿⢯⣿⣿⣿⣿⣿⡽⣿⢻⣿⣿⣿⣿⣿⣿⢿⣿⣿⣻⣿⣿⣿⣿⣼⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣼⡿⠿⣿⣿⣿⣿⣿⣿⣿⡏⠸⣿⣿⣿⣿⣿⣿⣎⠹⣿⣿⣿⣿⣿⣿⣯⣻⣿⡏⣿⣿⣿⣿⢿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣿⡟⠋⢥⣾⣿⣿⣿⣿⣿⣿⢿⣿⡇⠀⢿⠸⣿⣿⣿⣿⣿⣷⣻⣷⣝⢿⣿⣿⣿⣷⠙⡇⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣛⣿⣿⡿⣋⣴⣾⣿⣿⣿⣿⣿⣿⣿⣏⣿⣿⣿⡀⠈⠀⠹⣿⡻⣟⢿⣿⣷⣻⣿⣿⡻⣿⣿⣿⡇⡇⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢀⣠⡾⣟⣫⣷⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣹⣿⣿⣿⣷⡀⢰⣷⡸⣷⡈⠳⣮⡻⢧⢿⣿⣷⠹⢻⣿⡇⣿⣿⣿⣿⣿⣧⢿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣠⣴⠿⠓⠉⠥⠚⢉⣴⣿⡿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣸⣿⣧⢻⣿⡄⢹⣿⣦⡸⣿⣿⡇⢸⣿⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢠⠞⠉⠀⠀⠀⠀⠀⣰⠿⠋⣡⣾⣿⣿⠟⠋⣼⣿⣿⣿⣿⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣼⣿⣿⣷⣿⣿⡇⣾⣿⣿⣿⣿⣿⣿⣿⠁⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠐⠁⠀⢀⣴⣄⠀⠀⠔⠁⢀⣾⠿⠛⠉⠀⠀⣼⣿⡿⣻⣿⡿⠟⣹⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⣠⣴⣿⣿⣿⡆⠀⠀⠠⠛⠁⠀⠀⠀⠀⣼⣿⠛⡽⠛⠉⠀⢠⣿⣿⣿⠀⣿⣿⣿⢻⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⢹⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢀⣤⣾⣿⠟⠉⣿⣿⡇⠀⠀⠁⠀⠀⠀⠀⠀⣾⠟⠁⠈⠀⠀⠀⢠⣿⣿⡟⠁⠀⣿⣿⠇⣾⣿⣿⣿⡇⣿⠟⣼⣿⠟⣿⣿⣿⡿⠀⣼⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢀⠻⣿⣿⠆⠀⣿⣿⡇⢀⣴⣷⣄⠀⠀⠀⡼⠁⠀⠀⠀⠀⢀⣴⡿⠟⠁⠀⠀⢠⡿⠁⢀⣿⣿⣿⡿⠀⠁⢠⡿⠃⢰⣿⣿⡟⠁⡰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠈⠀⠈⠁⢀⡄⣿⣿⡇⢀⣽⣿⣿⠆⠀⠈⣠⠀⠀⠀⠀⠔⠛⠁⠀⠀⠀⠀⢀⠊⠀⠀⣸⣿⣿⡿⠁⠀⠐⠉⠀⢠⣿⣿⠋⠀⠐⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⢰⠃⠀⠀⠀⣿⣿⣷⣿⡿⠋⠀⢀⣴⣾⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⠀⠀⠀⠀⣴⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⢠⠆⠀⡠⠀⠻⣿⠟⠉⠀⣠⣴⣿⡿⠋⠙⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠟⠁⠀⠀⠀⠀⣠⡾⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⣺⣿⢿⣿⣷⣄⣴⣦⡀⢀⣤⣦⠀⠀⠀⠀⠀⠀⠀⢠⠟⠁⠀⠀⠀⠀⣠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢀⡤⠂⠀⠐⠁⠀⠀⢀⡞⠁⠀⠀⠙⣿⣿⣿⠋⠀⠈⣻⣿⣷⡄⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢠⠀⠀⠀⠀⠀⠀⠀⠈⢠⠆⠀⢀⠄⠈⠻⣿⣷⣤⣾⣿⠟⠁⢀⣠⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠠⠆⠀⠀⠀⣠⠀⠉⠀⠈⠀⣽⣿⡿⠋⠀⣠⣶⣿⠿⢿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⡀⠀⠀⠈⠁⡀⠀⢀⡤⠀⠈⠉⠀⢴⣾⣿⣿⣅⠀⢀⣿⣿⣷⣦⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠚⠁⠀⠀⠀⡋⠀⠀⠉⠀⠀⠀⠀⡰⠂⠉⠙⢿⣿⣿⣿⠟⠋⠻⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢀⡄⠀⠀⠀⠋⠀⠘⠃⠀⠀⠀⠀⠀⠀⠘⠁⢀⠀⢠⠆⠙⣿⣿⣦⣀⣤⣿⡿⠁⣠⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠰⠋⠀⠀⠀⠀⠴⠀⠀⠀⠀⠀⠀⠀⠀⠋⠀⢀⠈⠀⠀⡴⠀⠈⣻⣿⣿⠿⢋⣤⣾⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢚⠀⠀⠀⠀⠈⠀⠀⠀⠀⢀⡀⠻⠟⣁⣴⣿⡿⠛⢹⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠋⠀⠋⠀⡴⠀⠀⠒⠀⠂⠀⠐⠉⠀⢀⠀⠈⠻⣿⣷⠄⢸⣿⣿⠀⢠⣾⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⡀⠀⠱⠀⠀⠞⠁⠀⠀⠀⠀⠠⠊⠀⡀⠀⠩⠇⣠⢸⣿⣿⠀⣨⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⡀⠉⠀⠀⠸⠀⠀⠠⠂⠀⠀⠀⠀⠀⠀⠀⠠⠀⠀⡄⠀⡠⡠⠀⢸⣿⣿⣾⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⡴⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠊⠠⠄⠀⠀⢀⠄⠀⡠⢀⡈⢻⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⡠⠀⠀⣡⠄⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠤⠀⠈⠉⠁⠠⠂⠀⠑⠉⡀⠀⡠⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⢀⠀⠀⠈⢀⡠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢀⠀⢁⡀⠀⠀⠁⠠⢆⠐⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀

"""
print(logo)

try:
    with open('bot_info.pickle', 'rb') as file:
        bot_info = pickle.load(file)
        token = bot_info['token']
        chat_id = bot_info['chat_id']
except FileNotFoundError:
    token = input("\x1b[1mEnter Bot Token: ")
    chat_id = input("\x1b[1mEnter Chat ID: ")
    
    bot_info = {'token': token, 'chat_id': chat_id}
    with open('bot_info.pickle', 'wb') as file:
        pickle.dump(bot_info, file)
bot = telebot.TeleBot(token)

def sdeed():
    def mahos(user):
        uarr="https://www.instagram.com/accounts/web_create_ajax/attempt/"
        url = requests.post(uarr,headers ={'Host':'www.instagram.com',
    'content-length':'85',
    'sec-ch-ua':'" Not A;Brand";v="99", "Chromium";v="101"',
    'x-ig-app-id':'936619743392459',
    'x-ig-www-claim':'0',
    'sec-ch-ua-mobile':'?0',
    'x-instagram-ajax':'81f3a3c9dfe2',
    'content-type':'application/x-www-form-urlencoded',
    'accept':'*/*',
    'x-requested-with':'XMLHttpRequest',
    'x-asbd-id':'198387',
    'user-agent':f'{user_agent}',
    'x-csrftoken':'jzhjt4G11O37lW1aDFyFmy1K0yIEN9Qv',
    'sec-ch-ua-platform':'"Linux"',
    'origin':'https://www.instagram.com',
    'sec-fetch-site':'same-origin',
    'sec-fetch-mode':'cors',
    'sec-fetch-dest':'empty',
    'referer':'https://www.instagram.com/accounts/emailsignup/',
    'accept-encoding':'gzip, deflate, br',
    'accept-language':'en-IQ,en;q=0.9',
    'cookie':'csrftoken=jzhjt4G11O37lW1aDFyFmy1K0yIEN9Qv',
    'cookie':'mid=YtsQ1gABAAEszHB5wT9VqccwQIUL',
    'cookie':'ig_did=227CCCC2-3675-4A04-8DA5-BA3195B46425',
    'cookie':'ig_nrcb=1'},data=f'email=aakmnnsjskksmsnsn%40gmail.com&username={user}&first_name=&opt_into_one_tap=false')
    
        if '{"message":"feedback_required","spam":true,"feedback_title":"Try Again Later","feedback_message":"We limit how often you can do certain things on Instagram to protect our community. Tell us if you think we made a mistake.","feedback_url":"repute/report_problem/scraping/","feedback_appeal_label":"Tell us","feedback_ignore_label":"OK","feedback_action":"report_problem","status":"fail"}' in url.text:
            print(f" » {Z} no user » {x}{user} ",end='\r')
        elif  '"errors": {"username":' in url.text or  '"code": "username_is_taken"' in url.text:
            print(Z+f" »{Z} Unavailable » {Z}{user} ",end='\r')
        else:
            email=0
            print(f"\n » {F} available» {F}{user}\n")
            email+=1
            
            formatted_message = f"""
    *User instagram:* `{user}`
    
    [*Tool developer*](https://t.me/U_J_3)
    """
            bot.send_message(chat_id, formatted_message, parse_mode='MarkdownV2')
    
    
    def randomusers():
        while True:
         KK ="qwertyuiopasdfghjklzxcvbnm1234567890_."
         ZEBZ=''.join(random.choices('_', k=1))
         ZEBZ2=''.join(random.choices(KK, k=1))
         ZEBZ3=''.join(random.choices(KK, k=1))
         ZEBZ4=''.join(random.choices(KK, k=1))
         ZEBZ5=''.join(random.choices('_', k=1))
         ALL=ZEBZ+ZEBZ2+ZEBZ3+ZEBZ4+ZEBZ5
         user = ALL
         mahos(user)
    randomusers()
    
    
    
num_threads = 5 #عدد الخبوط {انصح5}
threads = []
for _ in range(num_threads):
    t = threading.Thread(target=sdeed)
    threads.append(t)
for t in threads:
    t.start()
for t in threads:
    t.join()    
